model name: rgb_8_8_8
created: 20211205
bare-Earth file: test_dat/SAMPLE_Elwha_WA_20170324_noveg.laz
vegetation file: test_dat/SAMPLE_Elwha_WA_20170324_veg.laz
model inputs: ['r', 'g', 'b']
Model: "rgb_8_8_8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
b (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
g (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
r (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
dense_features (DenseFeatures)  (None, 3)            0           b[0][0]                          
                                                                 g[0][0]                          
                                                                 r[0][0]                          
__________________________________________________________________________________________________
L0_8_nodes (Dense)              (None, 8)            32          dense_features[0][0]             
__________________________________________________________________________________________________
L1_8_nodes (Dense)              (None, 8)            72          L0_8_nodes[0][0]                 
__________________________________________________________________________________________________
L2_8_nodes (Dense)              (None, 8)            72          L1_8_nodes[0][0]                 
__________________________________________________________________________________________________
Dropout (Dropout)               (None, 8)            0           L2_8_nodes[0][0]                 
__________________________________________________________________________________________________
Output (Dense)                  (None, 1)            9           Dropout[0][0]                    
==================================================================================================
Total params: 185
Trainable params: 185
Non-trainable params: 0
__________________________________________________________________________________________________
validation accuracy: 0.0
validation loss: 0.0
train time: 84.18306517601013
