Model: "model_rgb_4_8_16"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
b (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
g (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
r (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
dense_features (DenseFeatures)  (None, 3)            0           b[0][0]                          
                                                                 g[0][0]                          
                                                                 r[0][0]                          
__________________________________________________________________________________________________
L0_4_nodes (Dense)              (None, 4)            16          dense_features[0][0]             
__________________________________________________________________________________________________
L1_8_nodes (Dense)              (None, 8)            40          L0_4_nodes[0][0]                 
__________________________________________________________________________________________________
L2_16_nodes (Dense)             (None, 16)           144         L1_8_nodes[0][0]                 
__________________________________________________________________________________________________
Dropout (Dropout)               (None, 16)           0           L2_16_nodes[0][0]                
__________________________________________________________________________________________________
Output (Dense)                  (None, 1)            17          Dropout[0][0]                    
==================================================================================================
Total params: 217
Trainable params: 217
Non-trainable params: 0
__________________________________________________________________________________________________
created: 20220217
bare-Earth file: C:/Users/pwernette/OneDrive - DOI/GitHub/point_cloud_vegetation_filtering/misc/test_dat/SAMPLE_Elwha_WA_20170324_noveg.laz
vegetation file: C:/Users/pwernette/OneDrive - DOI/GitHub/point_cloud_vegetation_filtering/misc/test_dat/SAMPLE_Elwha_WA_20170324_veg.laz
model inputs: ['r', 'g', 'b']
validation accuracy: 0.0
validation loss: 0.0
train time: 0:00:29.679107
