Model: "rgb_8"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
b (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
g (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
r (InputLayer)                  [(None, 1)]          0                                            
__________________________________________________________________________________________________
dense_features (DenseFeatures)  (None, 3)            0           b[0][0]                          
                                                                 g[0][0]                          
                                                                 r[0][0]                          
__________________________________________________________________________________________________
L0_8_nodes (Dense)              (None, 8)            32          dense_features[0][0]             
__________________________________________________________________________________________________
Dropout (Dropout)               (None, 8)            0           L0_8_nodes[0][0]                 
__________________________________________________________________________________________________
Output (Dense)                  (None, 1)            9           Dropout[0][0]                    
==================================================================================================
Total params: 41
Trainable params: 41
Non-trainable params: 0
__________________________________________________________________________________________________
created: 20211225
bare-Earth file: C:/Users/pwernette/OneDrive - DOI/GitHub/point_cloud_vegetation_filtering/misc/test_dat/SAMPLE_Elwha_WA_20170324_noveg.laz
vegetation file: C:/Users/pwernette/OneDrive - DOI/GitHub/point_cloud_vegetation_filtering/misc/test_dat/SAMPLE_Elwha_WA_20170324_veg.laz
model inputs: ['r', 'g', 'b']
validation accuracy: 0.0
validation loss: 0.0
train time: 1:00:18.150457
